[
  {
    "name": "Classic Margherita Pizza",
    "category": "Italian",
    "description": "Experience the authentic taste of Italy with our Classic Margherita Pizza. This masterpiece starts with a hand-stretched dough, cold-fermented for 48 hours to ensure a light, airy crust that is both crispy and chewy. It is generously layered with a rich, house-made San Marzano tomato sauce, infused with fresh garlic and extra virgin olive oil. On top, we melt fresh buffalo mozzarella, creating a creamy texture that perfectly balances the acidity of the tomatoes. To finish, fresh basil leaves are added after baking to preserve their aromatic oils, followed by a sprinkle of sea salt. This pizza is not just a meal; it’s a journey through the streets of Naples. Whether you’re enjoying a quiet dinner or sharing with friends, its simplicity and high-quality ingredients make it a timeless favorite for food enthusiasts everywhere. Every bite offers a harmonious blend of flavors that celebrates the tradition of Italian craftsmanship and culinary excellence.",
    "price": 12.99,
    "image": "https://via.placeholder.com/300",
    "rating": 4.8,
    "available": true,
    "createdAt": "2025-12-25T13:30:00Z",
    "updatedAt": "2025-12-25T13:30:00Z",
    "review": { "count": 120, "average": 4.8, "comments": [] }
  },
  {
    "name": "Spicy Chicken Tikka",
    "category": "Indian",
    "description": "Dive into the bold and vibrant world of Indian spices with our signature Spicy Chicken Tikka. We select only the finest, succulent chicken breast pieces, which are marinated for over twelve hours in a secret blend of thick Greek yogurt, freshly ground cumin, coriander, turmeric, and high-quality Kashmiri chili powder for that iconic deep red hue. The meat is then skewered and charred to perfection in a traditional clay tandoor oven, resulting in a smoky aroma and a tender, melt-in-your-mouth texture. This dish is served on a bed of aromatic saffron-infused basmati rice, accompanied by a cooling mint-cilantro chutney and thin slices of red onion and lemon wedges. The heat from the spices is perfectly tempered by the yogurt marinade, creating a complex flavor profile that is both fiery and comforting. Perfect for those who crave a punch of flavor, this dish represents the soul of South Asian street food, brought directly to your table with love.",
    "price": 14.50,
    "image": "https://via.placeholder.com/300",
    "rating": 4.9,
    "available": true,
    "createdAt": "2025-12-25T13:30:00Z",
    "updatedAt": "2025-12-25T13:30:00Z",
    "review": { "count": 85, "average": 4.9, "comments": [] }
  },
  {
    "name": "Veggie Tacos",
    "category": "Mexican",
    "description": "Our Veggie Tacos are a celebration of fresh, seasonal produce and vibrant Mexican flavors. Each serving comes with three soft corn tortillas that are lightly toasted on the griddle. Inside, you will find a colorful medley of grilled bell peppers, caramelized sweet onions, charred corn, and zesty black beans seasoned with smoky chipotle peppers. To add a layer of creaminess, we top the vegetables with hand-mashed Hass avocados and a sprinkle of tangy cotija cheese. A house-made pico de gallo provides a refreshing crunch, while a squeeze of lime juice ties all the elements together. These tacos are not only healthy and satisfying but also naturally gluten-free. Ideal for vegetarians and veggie-lovers alike, this dish offers a balanced mix of textures and tastes that will make you forget there's no meat involved. It’s a bright, festive, and delicious option for any time of the day.",
    "price": 8.99,
    "image": "https://via.placeholder.com/300",
    "rating": 4.5,
    "available": true,
    "createdAt": "2025-12-25T13:30:00Z",
    "updatedAt": "2025-12-25T13:30:00Z",
    "review": { "count": 45, "average": 4.5, "comments": [] }
  },
  {
    "name": "Salmon Sushi Rolls",
    "category": "Japanese",
    "description": "Indulge in the delicate artistry of Japanese cuisine with our premium Salmon Sushi Rolls. We use only the highest grade of Atlantic salmon, known for its buttery texture and rich omega-3 content. The salmon is sliced with precision and wrapped around seasoned vinegared sushi rice, which is fluffy and slightly sweet. Inside the roll, you'll also find crisp English cucumbers and ripe avocado slices, adding a refreshing contrast to the richness of the fish. The roll is then tightly bound in toasted nori seaweed. We serve this dish with a side of pickled ginger (gari) to cleanse your palate, fiery wasabi for an extra kick, and naturally brewed soy sauce for dipping. Whether you are a sushi connoisseur or a newcomer, the freshness of our ingredients and the balance of flavors will leave you wanting more. It's a light yet fulfilling meal that highlights the beauty of simple, high-quality seafood prepared with expert care.",
    "price": 18.00,
    "image": "https://via.placeholder.com/300",
    "rating": 4.7,
    "available": true,
    "createdAt": "2025-12-25T13:30:00Z",
    "updatedAt": "2025-12-25T13:30:00Z",
    "review": { "count": 62, "average": 4.7, "comments": [] }
  },
  {
    "name": "Double Bacon Cheeseburger",
    "category": "American",
    "description": "Get ready for the ultimate comfort food experience with our Double Bacon Cheeseburger. This beast features two half-pound patties of 100% prime Angus beef, seasoned with our signature spice rub and seared to juicy perfection on a flat-top grill. We layer each patty with melted sharp cheddar cheese and stack them high on a toasted brioche bun that’s been brushed with garlic butter. The burger is then topped with thick-cut, applewood-smoked bacon strips for a salty, smoky crunch. To balance the richness, we add crisp iceberg lettuce, vine-ripened tomatoes, sliced red onions, and tangy dill pickles. Our secret 'Bites Sauce'—a creamy blend of mayo, mustard, and secret spices—is spread generously on both sides of the bun. This is not just a burger; it's a satisfying explosion of classic American flavors that will satisfy even the biggest appetite. Served with a side of golden, salted fries, it’s the perfect treat for your cheat day.",
    "price": 15.99,
    "image": "https://via.placeholder.com/300",
    "rating": 4.9,
    "available": true,
    "createdAt": "2025-12-25T13:30:00Z",
    "updatedAt": "2025-12-25T13:30:00Z",
    "review": { "count": 210, "average": 4.9, "comments": [] }
  },
  {
    "name": "Penne Arrabbiata",
    "category": "Italian",
    "description": "For those who enjoy a bit of heat, our Penne Arrabbiata is the perfect choice. Arrabbiata literally means 'angry' in Italian, referring to the spicy kick of the chili peppers used in the sauce. We start by sautéing thinly sliced garlic in extra virgin olive oil until golden, then add crushed red pepper flakes and plump, peeled tomatoes. The sauce is simmered slowly until it thickens and the flavors intensify. We toss this fiery sauce with perfectly al dente penne pasta, ensuring every tube is coated inside and out. To finish, we garnish the dish with fresh chopped parsley and a generous grating of Pecorino Romano cheese, which adds a salty depth. This dish is simple yet incredibly bold, representing the rustic and passionate cooking style of central Italy. It’s a wonderful vegetarian option that doesn’t compromise on flavor or satisfaction, providing a warm and spicy embrace in every bite.",
    "price": 11.50,
    "image": "https://via.placeholder.com/300",
    "rating": 4.4,
    "available": true,
    "createdAt": "2025-12-25T13:30:00Z",
    "updatedAt": "2025-12-25T13:30:00Z",
    "review": { "count": 38, "average": 4.4, "comments": [] }
  },
  {
    "name": "Beef Burrito Bowl",
    "category": "Mexican",
    "description": "Our Beef Burrito Bowl is a deconstructed version of the classic burrito, packed with all your favorite flavors without the tortilla. It starts with a base of cilantro-lime white rice and slow-cooked black beans. The star of the bowl is our tender, shredded beef barbacoa, which is braised for eight hours with chipotle, cumin, and cloves until it literally falls apart. We add a scoop of fresh guacamole, roasted corn salsa with poblano peppers, and a sprinkle of shredded Monterey Jack cheese. For a refreshing finish, we add crisp romaine lettuce and a dollop of cool sour cream. A side of our house-made salsa verde allows you to control the spice level. This bowl is a nutrient-dense and high-protein meal that is perfect for a quick lunch or a healthy dinner. It’s a colorful and satisfying way to enjoy the bold, earthy flavors of Mexico in a convenient and modern format.",
    "price": 13.75,
    "image": "https://via.placeholder.com/300",
    "rating": 4.6,
    "available": true,
    "createdAt": "2025-12-25T13:30:00Z",
    "updatedAt": "2025-12-25T13:30:00Z",
    "review": { "count": 76, "average": 4.6, "comments": [] }
  },
  {
    "name": "Lamb Rogan Josh",
    "category": "Indian",
    "description": "Lamb Rogan Josh is a hallmark of Kashmiri cuisine, known for its rich red color and aromatic gravy. We use tender chunks of grass-fed lamb, which are slowly braised in a sauce composed of browned onions, yogurt, garlic, ginger, and a blend of traditional spices. The deep red color comes from the generous use of Kashmiri chilies, which provide flavor and color without being overwhelmingly spicy. Spices like cardamom, cinnamon, and cloves are toasted and ground in-house to ensure maximum freshness. The long cooking process allows the spices to penetrate the meat, making it incredibly flavorful and tender enough to cut with a spoon. This dish is traditionally served with buttery naan bread or steamed basmati rice to soak up the luxurious gravy. It’s a hearty and sophisticated dish that offers a true taste of Northern Indian heritage, perfect for cold evenings or special celebrations.",
    "price": 17.50,
    "image": "https://via.placeholder.com/300",
    "rating": 4.9,
    "available": true,
    "createdAt": "2025-12-25T13:30:00Z",
    "updatedAt": "2025-12-25T13:30:00Z",
    "review": { "count": 54, "average": 4.9, "comments": [] }
  },
  {
    "name": "Shrimp Tempura",
    "category": "Japanese",
    "description": "Experience the light and crispy delight of our Shrimp Tempura. We take jumbo tiger prawns, clean them meticulously, and dip them into a traditional Japanese batter made with ice-cold sparkling water and low-protein flour. This technique creates a delicate, lace-like coating that stays incredibly crunchy without absorbing excess oil. The shrimp are flash-fried for just a few seconds to ensure they remain succulent and sweet on the inside. Alongside the shrimp, we include a variety of tempura-style vegetables such as sweet potato, broccoli florets, and bell peppers. The dish is served with a side of 'Tentsuyu' dipping sauce—a savory blend of dashi broth, soy sauce, and mirin—and a small mound of grated daikon radish and ginger. This dish is a masterclass in texture and balance, offering a sophisticated appetizer or a light main course that celebrates the natural flavors of the sea and the garden.",
    "price": 16.25,
    "image": "https://via.placeholder.com/300",
    "rating": 4.7,
    "available": true,
    "createdAt": "2025-12-25T13:30:00Z",
    "updatedAt": "2025-12-25T13:30:00Z",
    "review": { "count": 29, "average": 4.7, "comments": [] }
  },
  {
    "name": "Chocolate Lava Cake",
    "category": "Dessert",
    "description": "Our Chocolate Lava Cake is the ultimate dream for any chocolate lover. This decadent dessert features a rich, moist chocolate cake made with premium 70% dark Belgian cocoa. The magic happens inside, where a warm, molten chocolate center awaits to flow out at the first touch of your spoon. We bake each cake to order to ensure the perfect contrast between the firm outer shell and the liquid 'lava' interior. To balance the intense chocolate flavor, we serve it with a large scoop of handcrafted Madagascan vanilla bean ice cream and a drizzle of tart raspberry coulis. A dusting of powdered sugar and a few fresh mint leaves complete the presentation. This is the perfect ending to a romantic dinner or a special treat to share with a loved one. Each bite is a luxurious experience that combines different temperatures and textures, making it a truly unforgettable dessert that you'll crave long after the last bite.",
    "price": 9.50,
    "image": "https://via.placeholder.com/300",
    "rating": 4.9,
    "available": true,
    "createdAt": "2025-12-25T13:30:00Z",
    "updatedAt": "2025-12-25T13:30:00Z",
    "review": { "count": 142, "average": 4.9, "comments": [] }
  },
  {
    "name": "Fettuccine Alfredo",
    "category": "Italian",
    "description": "Indulge in the creamy richness of our signature Fettuccine Alfredo, a dish that defines Italian comfort food. We start with fresh, house-made fettuccine pasta, crafted with premium durum wheat and farm-fresh eggs for a silky texture. The sauce is a luxurious emulsion of high-quality European butter and aged Parmigiano-Reggiano cheese, melted together with a splash of heavy cream and infused with roasted garlic. Each strand of pasta is perfectly coated in this velvety white sauce, ensuring a consistent flavor in every bite. To elevate the dish, we add a touch of freshly grated nutmeg and cracked black pepper. Whether ordered as a vegetarian main or customized with grilled chicken or sautéed shrimp, this dish remains a favorite for its simplicity and deep, savory satisfaction. It is served hot with a side of toasted garlic bread, making it a complete and fulfilling meal for those who appreciate the finer things in Italian cuisine.",
    "price": 14.99,
    "image": "https://via.placeholder.com/300",
    "rating": 4.6,
    "available": true,
    "createdAt": "2025-12-25T13:30:00Z",
    "updatedAt": "2025-12-25T13:30:00Z",
    "review": { "count": 55, "average": 4.6, "comments": [] }
  },
  {
    "name": "Chicken Enchiladas",
    "category": "Mexican",
    "description": "Our Chicken Enchiladas are a vibrant explosion of traditional Mexican flavors. We take tender, hand-shredded chicken breast that has been slow-cooked with cumin, oregano, and mild chilies. This flavorful filling is rolled into soft corn tortillas and placed in a baking dish, where it is smothered in our house-made red enchilada sauce—a smoky blend of roasted tomatoes and guajillo peppers. A thick layer of Monterey Jack and Cheddar cheese is melted over the top until bubbling and slightly golden. Before serving, we garnish the dish with fresh cilantro, sliced jalapeños for a bit of heat, and a drizzle of tangy Mexican crema. Accompanied by a side of Mexican red rice and refried beans, these enchiladas offer a hearty and balanced meal. The combination of the soft tortillas, savory chicken, and rich, spicy sauce creates a nostalgic taste that brings the spirit of a Mexican family kitchen straight to your table.",
    "price": 13.50,
    "image": "https://via.placeholder.com/300",
    "rating": 4.7,
    "available": true,
    "createdAt": "2025-12-25T13:30:00Z",
    "updatedAt": "2025-12-25T13:30:00Z",
    "review": { "count": 68, "average": 4.7, "comments": [] }
  },
  {
    "name": "Miso Ramen",
    "category": "Japanese",
    "description": "Warm your soul with a steaming bowl of our authentic Miso Ramen. This dish features a complex broth that takes over 24 hours to prepare, combining chicken and pork stock with a fermented miso paste blend for a rich, umami-heavy base. Our thin, wavy wheat noodles are cooked to a perfect chewy consistency, designed to hold onto the flavorful broth. The ramen is topped with slices of tender, melt-in-your-mouth Chashu pork belly, a soft-boiled marinated Ajitama egg with a jammy yolk, and crunchy bamboo shoots (menma). Fresh scallions, sweet corn, and a sheet of toasted nori add layers of texture and freshness. For a final touch, a small pat of butter is added to give the broth an extra creamy finish. This bowl of ramen is more than just soup; it's a carefully balanced culinary experience that reflects the precision and passion of Japanese noodle culture. Perfect for a rainy day or whenever you need a bowl of pure comfort.",
    "price": 16.50,
    "image": "https://via.placeholder.com/300",
    "rating": 4.8,
    "available": true,
    "createdAt": "2025-12-25T13:30:00Z",
    "updatedAt": "2025-12-25T13:30:00Z",
    "review": { "count": 92, "average": 4.8, "comments": [] }
  },
  {
    "name": "Paneer Butter Masala",
    "category": "Indian",
    "description": "Paneer Butter Masala is a quintessential North Indian vegetarian dish that is loved for its creamy and mildly sweet profile. We use cubes of fresh, soft paneer (Indian cottage cheese), which are lightly sautéed before being simmered in a silky tomato-based gravy. The sauce is prepared with a blend of cashew paste, vine-ripened tomatoes, and a fragrant mix of spices including garam masala, cardamom, and dried fenugreek leaves (kasuri methi). A generous amount of butter and fresh cream is folded in at the end to create its signature smooth texture. This dish is perfectly balanced—not too spicy, yet bursting with aromatic flavors. It is traditionally served with garlic naan or tandoori roti, which are perfect for scooping up the rich sauce. Ideal for vegetarians and meat-eaters alike, this dish offers a royal dining experience that showcases the richness of Indian vegetarian cuisine. Each bite is a testament to the art of spice blending and slow-cooking.",
    "price": 12.50,
    "image": "https://via.placeholder.com/300",
    "rating": 4.9,
    "available": true,
    "createdAt": "2025-12-25T13:30:00Z",
    "updatedAt": "2025-12-25T13:30:00Z",
    "review": { "count": 104, "average": 4.9, "comments": [] }
  },
  {
    "name": "BBQ Bacon Burger",
    "category": "American",
    "description": "Take your burger game to the next level with our BBQ Bacon Burger. This American classic starts with a 100% grass-fed beef patty, char-grilled to lock in the juices and provide a smoky crust. We top the patty with melted sharp cheddar cheese and two strips of crispy, thick-cut maple bacon. The defining feature of this burger is our house-made hickory-smoked BBQ sauce, which adds a perfect balance of sweetness and tang. We stack it all on a toasted brioche bun with crispy onion straws for an extra crunch, fresh lettuce, and tomato slices. This burger is a symphony of textures—from the soft bun to the crunchy onions and the juicy meat. Served with a side of coleslaw and golden fries, it’s a hearty meal that captures the essence of a summer backyard barbecue. It’s bold, messy, and absolutely delicious, making it a must-try for any burger enthusiast looking for a flavor-packed experience.",
    "price": 15.25,
    "image": "https://via.placeholder.com/300",
    "rating": 4.8,
    "available": true,
    "createdAt": "2025-12-25T13:30:00Z",
    "updatedAt": "2025-12-25T13:30:00Z",
    "review": { "count": 73, "average": 4.8, "comments": [] }
  },
  {
    "name": "Tiramisu",
    "category": "Dessert",
    "description": "Our Tiramisu is a sophisticated Italian dessert that translates to 'pick me up,' and it does exactly that. We prepare this classic by dipping light and airy ladyfinger biscuits into a mixture of high-quality espresso and a hint of dark rum. These are then layered with a rich and velvety mascarpone cream, which is whipped with fresh egg yolks and sugar to achieve a cloud-like consistency. The layers are repeated to build a beautiful structure, and the top is finished with a heavy dusting of premium Dutch-processed cocoa powder. We let the dessert chill for at least six hours, allowing the flavors to meld and the biscuits to soften into a cake-like texture. Every spoonful offers a perfect balance of bitter coffee, creamy sweetness, and a touch of cocoa. It is served chilled and garnished with a small mint sprig and a chocolate shaving, providing an elegant and light conclusion to any meal.",
    "price": 8.50,
    "image": "https://via.placeholder.com/300",
    "rating": 4.9,
    "available": true,
    "createdAt": "2025-12-25T13:30:00Z",
    "updatedAt": "2025-12-25T13:30:00Z",
    "review": { "count": 89, "average": 4.9, "comments": [] }
  },
  {
    "name": "Seafood Paella",
    "category": "Spanish",
    "description": "Transport yourself to the coast of Spain with our magnificent Seafood Paella. This traditional dish is cooked in a wide, shallow paella pan to ensure the perfect 'socarrat'—the caramelized, crispy layer of rice at the bottom. We use short-grain Bomba rice, which perfectly absorbs the rich broth made from saffron, lobster shells, and aromatic vegetables. The paella is loaded with a bounty of fresh seafood, including succulent jumbo shrimp, fresh mussels, tender calamari rings, and sweet clams. Piquillo peppers and green peas add pops of color and sweetness, while a touch of smoked paprika gives the dish its characteristic depth. Each portion is served with fresh lemon wedges to brighten the flavors and a drizzle of extra virgin olive oil. This is a festive and social dish, designed to be shared and celebrated. It’s a labor of love that showcases the incredible freshness of the sea and the time-honored traditions of Spanish coastal cooking.",
    "price": 24.99,
    "image": "https://via.placeholder.com/300",
    "rating": 4.7,
    "available": true,
    "createdAt": "2025-12-25T13:30:00Z",
    "updatedAt": "2025-12-25T13:30:00Z",
    "review": { "count": 42, "average": 4.7, "comments": [] }
  },
  {
    "name": "Grilled Salmon Steak",
    "category": "Healthy",
    "description": "For a meal that is both nutritious and incredibly delicious, our Grilled Salmon Steak is an excellent choice. We source fresh, wild-caught salmon fillets, which are seasoned simply with sea salt, cracked black pepper, and a touch of lemon zest. The steak is grilled over an open flame to achieve a smoky char on the outside while maintaining a moist and flaky interior. It is served on a bed of fluffy quinoa pilaf mixed with roasted Mediterranean vegetables like zucchini, cherry tomatoes, and bell peppers. To finish, we drizzle a house-made lemon-herb vinaigrette over the fish, adding a bright and zesty punch. This dish is rich in heart-healthy omega-3 fatty acids and high-quality protein, making it a favorite for health-conscious diners. It’s a light, clean, and satisfying meal that proves healthy eating can be a truly gourmet experience. Every element on the plate is designed to complement the natural flavor of the salmon.",
    "price": 19.50,
    "image": "https://via.placeholder.com/300",
    "rating": 4.8,
    "available": true,
    "createdAt": "2025-12-25T13:30:00Z",
    "updatedAt": "2025-12-25T13:30:00Z",
    "review": { "count": 51, "average": 4.8, "comments": [] }
  },
  {
    "name": "Beef Lasagna",
    "category": "Italian",
    "description": "Our Beef Lasagna is a multi-layered masterpiece of comfort and flavor. It features layers of wide, rippled pasta sheets, each separated by a hearty Bolognese sauce made with slow-simmered ground beef, aromatics, and red wine. To add a creamy contrast, we include a traditional Béchamel sauce and a blend of three cheeses: Ricotta, Mozzarella, and Parmesan. The lasagna is baked until the cheese on top is golden brown and bubbling, and the edges of the pasta are slightly crispy. Each bite offers a satisfying mix of savory meat, silky pasta, and gooey cheese. This dish is prepared according to an old family recipe that emphasizes the importance of slow-cooking the sauce to develop a deep, complex flavor. Served with a side of mixed greens and a balsamic glaze, our lasagna is a filling and soul-warming meal that captures the essence of a traditional Italian Sunday dinner. It’s a classic that never goes out of style.",
    "price": 16.00,
    "image": "https://via.placeholder.com/300",
    "rating": 4.7,
    "available": true,
    "createdAt": "2025-12-25T13:30:00Z",
    "updatedAt": "2025-12-25T13:30:00Z",
    "review": { "count": 96, "average": 4.7, "comments": [] }
  },
  {
    "name": "Mango Lassi",
    "category": "Beverage",
    "description": "Cool down and refresh your palate with our world-famous Mango Lassi. This traditional Indian drink is a smooth and creamy blend of ripe, sweet Alphonso mangoes and thick, chilled yogurt. We add a touch of honey for natural sweetness and a pinch of ground cardamom to give it a unique aromatic finish. The result is a vibrant, golden-yellow smoothie that is both refreshing and incredibly satisfying. Our lassi is made fresh to order, ensuring the highest quality and best flavor. It’s the perfect accompaniment to spicy dishes, as the yogurt helps to soothe the heat, but it’s also a delicious treat on its own. Served in a tall glass with a garnish of crushed pistachios and a slice of fresh mango, it’s a beautiful and tasty way to enjoy the tropical flavors of the East. Whether you’re looking for a healthy snack or a refreshing beverage, our Mango Lassi is sure to delight your senses.",
    "price": 5.99,
    "image": "https://via.placeholder.com/300",
    "rating": 4.9,
    "available": true,
    "createdAt": "2025-12-25T13:30:00Z",
    "updatedAt": "2025-12-25T13:30:00Z",
    "review": { "count": 130, "average": 4.9, "comments": [] }
  },
  {
    "name": "Kung Pao Chicken",
    "category": "Chinese",
    "description": "Our Kung Pao Chicken is a classic Szechuan dish that offers a perfect balance of salty, sweet, and spicy notes. We use tender cubes of chicken breast, stir-fried in a wok with crunchy roasted peanuts, scallions, and dried red chilies. The secret lies in our authentic sauce made from dark soy sauce, black vinegar, and hoisin, creating a glossy coat over every ingredient. Bell peppers and celery are added for a refreshing crunch. This dish is famous for its 'mala' profile—a slight numbing sensation from Szechuan peppercorns that excites the palate. It is traditionally served with steamed jasmine rice, allowing the sauce to soak in. Perfect for those who love bold textures and a medium spice level, this dish brings the vibrant energy of Chinese street food to your plate with premium quality ingredients and expert wok technique.",
    "price": 13.99,
    "rating": 4.6,
    "image": "https://via.placeholder.com/300",
    "available": true,
    "createdAt": "2025-12-25T13:30:00Z",
    "updatedAt": "2025-12-25T13:30:00Z",
    "review": { "count": 45, "average": 4.6, "comments": [] }
  },
  {
    "name": "Thai Green Curry",
    "category": "Thai",
    "description": "Indulge in the aromatic and creamy flavors of our Thai Green Curry. This dish starts with a house-made curry paste using fresh green chilies, lemongrass, galangal, and kaffir lime leaves. We simmer this paste in rich, full-fat coconut milk to create a vibrant green sauce that is both spicy and sweet. The curry is loaded with tender chicken slices, bamboo shoots, Thai eggplant, and succulent green beans. We finish it with a handful of fresh Thai basil and a squeeze of lime to brighten the flavors. The contrast between the spicy chilies and the cooling coconut milk makes this dish incredibly addictive. Served with a side of fragrant basmati or jasmine rice, it’s a wholesome and exotic meal that transports your senses straight to the heart of Bangkok. It’s naturally gluten-free and packed with herbal goodness.",
    "price": 15.50,
    "rating": 4.8,
    "image": "https://via.placeholder.com/300",
    "available": true,
    "createdAt": "2025-12-25T13:30:00Z",
    "updatedAt": "2025-12-25T13:30:00Z",
    "review": { "count": 67, "average": 4.8, "comments": [] }
  },
  {
    "name": "Lamb Gyro Platter",
    "category": "Middle Eastern",
    "description": "Experience the legendary flavors of the Mediterranean with our Lamb Gyro Platter. We use premium lamb, seasoned with a blend of Mediterranean herbs like oregano, thyme, and garlic, then slow-roasted on a vertical rotisserie until the edges are crispy and the center is juicy. The meat is sliced thin and served over a bed of buttery turmeric rice. The platter includes a side of warm, fluffy pita bread, a crisp Greek salad with feta cheese and kalamata olives, and a generous dollop of our house-made tzatziki sauce—a cooling blend of Greek yogurt, cucumber, and dill. Every bite offers a satisfying mix of warm meat, cool sauce, and fresh vegetables. This dish is not only filling but also offers a balanced nutritional profile, making it a favorite for lunch or dinner. It is a true celebration of Middle Eastern hospitality and culinary tradition.",
    "price": 16.99,
    "rating": 4.7,
    "image": "https://via.placeholder.com/300",
    "available": true,
    "createdAt": "2025-12-25T13:30:00Z",
    "updatedAt": "2025-12-25T13:30:00Z",
    "review": { "count": 89, "average": 4.7, "comments": [] }
  },
  {
    "name": "Pad Thai",
    "category": "Thai",
    "description": "Our Pad Thai is the ultimate representation of Thailand’s most famous street food. We use thin rice noodles stir-fried in a hot wok with a complex tamarind-based sauce that hits every taste bud: sour, sweet, and salty. The dish is tossed with firm tofu, scrambled eggs, fresh bean sprouts, and your choice of shrimp or chicken. For the essential crunch and extra flavor, we top it with crushed roasted peanuts, fresh chives, and a wedge of lime to be squeezed over just before eating. A sprinkle of dried chili flakes is provided on the side for those who want to turn up the heat. This dish is celebrated for its intricate balance of textures and its bright, energetic flavor profile. It’s a fast-cooked, high-energy meal that’s perfect for a quick lunch or a flavorful dinner, offering a satisfying and authentic Thai experience in every forkful.",
    "price": 14.25,
    "rating": 4.9,
    "image": "https://via.placeholder.com/300",
    "available": true,
    "createdAt": "2025-12-25T13:30:00Z",
    "updatedAt": "2025-12-25T13:30:00Z",
    "review": { "count": 112, "average": 4.9, "comments": [] }
  },
  {
    "name": "Falafel Wrap",
    "category": "Middle Eastern",
    "description": "For a delicious and healthy vegetarian option, try our signature Falafel Wrap. Our falafels are made in-house from scratch using soaked chickpeas, fresh parsley, cilantro, and a blend of toasted spices like cumin and coriander. They are fried until golden-brown and crispy on the outside while remaining light and fluffy on the inside. We wrap these protein-packed jewels in a large, toasted flatbread along with hummus, tahini sauce, pickled turnips, and a fresh salad of diced tomatoes and cucumbers. The combination of the warm falafel and the creamy tahini creates a delightful contrast. This wrap is a portable and nutritious meal, rich in fiber and plant-based protein. It’s an authentic taste of Middle Eastern street food that’s perfect for anyone looking for a clean yet incredibly flavorful eating experience. Each wrap is made fresh to order to ensure the highest quality.",
    "price": 10.50,
    "rating": 4.5,
    "image": "https://via.placeholder.com/300",
    "available": true,
    "createdAt": "2025-12-25T13:30:00Z",
    "updatedAt": "2025-12-25T13:30:00Z",
    "review": { "count": 56, "average": 4.5, "comments": [] }
  },
  {
    "name": "New York Cheesecake",
    "category": "Dessert",
    "description": "Our New York Cheesecake is a slice of pure heaven. Built on a thick, buttery Graham cracker crust, the filling is exceptionally dense, smooth, and creamy, made with premium full-fat cream cheese, fresh eggs, and a hint of lemon zest for a subtle tang. We bake it slowly in a water bath to ensure a perfectly flat top without any cracks and a texture that melts in your mouth. Each slice is served with a generous topping of house-made strawberry compote and a dollop of whipped cream. The richness of the cheesecake is perfectly balanced by the acidity of the berries. This is a heavy, satisfying dessert that is perfect for sharing or indulging on your own. It represents the classic American deli tradition, brought to life with high-quality ingredients and meticulous baking techniques. One bite and you'll understand why it's a worldwide favorite.",
    "price": 8.99,
    "rating": 4.9,
    "image": "https://via.placeholder.com/300",
    "available": true,
    "createdAt": "2025-12-25T13:30:00Z",
    "updatedAt": "2025-12-25T13:30:00Z",
    "review": { "count": 150, "average": 4.9, "comments": [] }
  },
  {
    "name": "Beef & Broccoli Stir-Fry",
    "category": "Chinese",
    "description": "A staple of Chinese-American cuisine, our Beef and Broccoli Stir-Fry is all about the quality of the ingredients. We use flank steak, sliced thinly against the grain to ensure maximum tenderness, and marinate it in a savory mix of ginger, garlic, and soy. The beef is quickly seared in a blazing hot wok and then tossed with fresh, vibrant broccoli florets. The sauce is a rich, dark brown glaze made from oyster sauce and toasted sesame oil, providing a deep umami flavor. The broccoli is cooked just enough to retain its bright green color and a slight crunch. Served with a side of steamed brown or white rice, this dish is a balanced meal providing protein and greens in a delicious package. It’s a clean, savory, and comforting dish that appeals to all ages, showcasing the art of quick wok cooking where high heat locks in both nutrition and flavor.",
    "price": 14.50,
    "rating": 4.6,
    "image": "https://via.placeholder.com/300",
    "available": true,
    "createdAt": "2025-12-25T13:30:00Z",
    "updatedAt": "2025-12-25T13:30:00Z",
    "review": { "count": 42, "average": 4.6, "comments": [] }
  },
  {
    "name": "Chicken Shawarma Plate",
    "category": "Middle Eastern",
    "description": "Our Chicken Shawarma Plate features succulent thighs and breasts marinated for 24 hours in a blend of Middle Eastern spices, including allspice, cinnamon, and nutmeg. The chicken is grilled to perfection, giving it a smoky aroma and juicy interior. It is served sliced over a bed of fragrant yellow rice with a side of creamy garlic sauce (toum) that is bold and punchy. To round out the meal, we include grilled tomatoes, onions, and a small portion of tabbouleh salad made with fresh parsley and bulgur wheat. The combination of the spiced meat and the intense garlic sauce is a match made in heaven. This plate offers a variety of flavors and textures, from the zesty salad to the savory rice and tender chicken. It’s a hearty and healthy option that showcases the best of Levantine cuisine, prepared with love and authentic techniques.",
    "price": 15.75,
    "rating": 4.8,
    "image": "https://via.placeholder.com/300",
    "available": true,
    "createdAt": "2025-12-25T13:30:00Z",
    "updatedAt": "2025-12-25T13:30:00Z",
    "review": { "count": 74, "average": 4.8, "comments": [] }
  },
  {
    "name": "Shrimp Dumplings (Dim Sum)",
    "category": "Chinese",
    "description": "Delight in the delicate flavors of our handmade Shrimp Dumplings, also known as Har Gow. These translucent gems are a hallmark of Cantonese Dim Sum. Each dumpling features a filling of whole, snappy shrimp seasoned with bamboo shoots, sesame oil, and white pepper. The wrapping is a thin, pleated skin made from wheat and tapioca starch, which becomes beautifully translucent when steamed. We steam them in traditional bamboo baskets to preserve their moisture and delicate shape. Served with a side of light soy sauce and our house-made chili oil, these dumplings are an elegant appetizer or part of a larger meal. The focus here is on the natural sweetness of the shrimp and the artisan skill required to create the perfect pleats. Light, healthy, and incredibly flavorful, they are a must-try for any lover of authentic Chinese seafood dishes.",
    "price": 9.25,
    "rating": 4.7,
    "image": "https://via.placeholder.com/300",
    "available": true,
    "createdAt": "2025-12-25T13:30:00Z",
    "updatedAt": "2025-12-25T13:30:00Z",
    "review": { "count": 38, "average": 4.7, "comments": [] }
  },
  {
    "name": "Baklava Medley",
    "category": "Dessert",
    "description": "End your meal on a sweet and crunchy note with our Baklava Medley. This traditional Middle Eastern pastry is made from dozens of layers of paper-thin phyllo dough, brushed with clarified butter and filled with a mixture of finely chopped pistachios, walnuts, and a hint of cinnamon. After being baked to a perfect golden-brown, the pastry is drenched in a fragrant syrup made with honey, rose water, and lemon juice. The result is a dessert that is incredibly flaky, nutty, and sweet, with a floral aroma that lingers on the palate. Our medley includes different shapes and nut fillings, offering a variety of textures in one serving. It is served with a small cup of strong Turkish coffee or mint tea to balance the sweetness. Baklava is a labor-intensive dessert that represents centuries of culinary history, and our version is made with the highest quality nuts and honey for a truly royal experience.",
    "price": 7.50,
    "rating": 4.9,
    "image": "https://via.placeholder.com/300",
    "available": true,
    "createdAt": "2025-12-25T13:30:00Z",
    "updatedAt": "2025-12-25T13:30:00Z",
    "review": { "count": 62, "average": 4.9, "comments": [] }
  }
]